Repository: chater-marzougui/Zakaria-School
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Dashboard
ar: لوحة التحكم

source: Chats
ar: المحادثات

source: Profile
ar: الملف الشخصي

source: Proofs
ar: إثباتات

source: Sponsors
ar: الرعاة

source: Settings
ar: الإعدادات

source: Lands
ar: الأراضي

source: Logout
ar: تسجيل الخروج

source: Cancel
ar: إلغاء

source: Close
ar: إغلاق

source: Conversations
ar: المحادثات

# plantDiseaseId
source: Plant Disease Identification
ar: تحديد أمراض النباتات

# takePhotosOfSickPlants
source: Take photos of sick plants for diagnosis
ar: التقط صورًا للنباتات المريضة لتشخيصها

source: Irrigation Advice
ar: نصائح الري

source: Watering schedules and techniques
ar: جداول وتقنيات الري

source: Crop Care
ar: العناية بالمحاصيل

# fertilizersSoilNutrition
source: Fertilizers and soil nutrition
ar: الأسمدة وتغذية التربة

source: Pest Control
ar: مكافحة الآفات

source: Identify and treat plant pests
ar: تحديد ومعالجة آفات النباتات

source: Weather Tips
ar: نصائح الطقس

source: Weather-based farming guidance
ar: إرشادات زراعية حسب الطقس

source: Title
ar: العنوان

source: Size
ar: الحجم

source: Crop
ar: المحصول

source: Location
ar: الموقع

source: Progress
ar: التقدم

source: Voice
ar: صوت

source: An unexpected error occurred
ar: حدث خطأ غير متوقع

source: Apply Changes
ar: تطبيق التغييرات

source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Change Password
ar: تغيير كلمة المرور

source: Choose an image source
ar: اختر مصدر الصورة

source: Complete Profile
ar: أكمل الملف الشخصي

source: Complete Your Profile
ar: أكمل ملفك الشخصي

source: Confirm Password
ar: تأكيد كلمة المرور

source: Contact Information
ar: معلومات الاتصال

source: Contact Support
ar: الاتصال بالدعم

source: Create an Account
ar: إنشاء حساب

source: Current: {_selectedThemeMode}
ar: الحالي: {_selectedThemeMode}

source: Dart Template
ar: قالب دارت

source: Don't have an account? Sign up
ar: ليس لديك حساب؟ سجل الآن

source: Edit Profile
ar: تعديل الملف الشخصي

source: Email Address
ar: البريد الإلكتروني

source: Enable Notifications
ar: تفعيل الإشعارات

source: Enter the subject of your message
ar: أدخل موضوع رسالتك

source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Enter your email to recover your password
ar: أدخل بريدك الإلكتروني لاستعادة كلمة المرور

source: Enter your message
ar: أدخل رسالتك

source: Enter your name
ar: أدخل اسمك

source: Enter your password
ar: أدخل كلمة المرور

source: Error occurred during signup.
ar: حدث خطأ أثناء التسجيل.

# errorOccurredWhileUploadingTheImage
source: Error occurred while uploading the image: {e}
ar: حدث خطأ أثناء رفع الصورة: {e}

# errorPostingComment
source: Error posting comment: {e}
ar: حدث خطأ أثناء نشر التعليق: {e}

# errorReauthenticatingUser
source: Error reauthenticating user: {e}
ar: خطأ أثناء إعادة التحقق من المستخدم: {e}

# errorSendingPasswordRecoveryEmail
source: Error sending password recovery email: {e}
ar: خطأ أثناء إرسال بريد استعادة كلمة المرور: {e}

source: Error signing out
ar: خطأ أثناء تسجيل الخروج

source: Error submitting support request
ar: خطأ أثناء إرسال طلب الدعم

# errorUpdatingPassword
source: Error updating password: {e}
ar: خطأ أثناء تحديث كلمة المرور: {e}

# errorUpdatingProfile
source: Error updating profile: {e}
ar: خطأ أثناء تحديث الملف الشخصي: {e}

# errorSnapshotError
source: Error: {error}
ar: خطأ: {error}

# failedToCreateProfile
source: Failed to create profile: {toString}
ar: فشل في إنشاء الملف الشخصي: {toString}

source: Failed to upload image
ar: فشل في رفع الصورة

source: First Name
ar: الاسم الأول

source: First name is required
ar: الاسم الأول مطلوب

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: Gender is required
ar: الجنس مطلوب

source: Incorrect password
ar: كلمة المرور غير صحيحة

source: Invalid email address
ar: عنوان البريد الإلكتروني غير صالح

source: Last Name
ar: الاسم الأخير

source: Last name is required
ar: الاسم الأخير مطلوب

source: Login failed
ar: فشل تسجيل الدخول

# loginFailedWithMessage
source: Login failed: {message}
ar: فشل تسجيل الدخول: {message}

source: New Password
ar: كلمة مرور جديدة

source: No account found with this email
ar: لا يوجد حساب بهذا البريد الإلكتروني

source: No comments yet
ar: لا توجد تعليقات بعد

source: Old Password
ar: كلمة المرور القديمة

source: Or continue with
ar: أو المتابعة عبر

# passwordRequirements
source: Password must be at least 8 characters long and contain a number
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل وتحتوي على رقم

source: Password updated successfully
ar: تم تحديث كلمة المرور بنجاح

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# passwordsDoNotMatchExclamation
source: Passwords do not match!
ar: كلمتا المرور غير متطابقتين!

source: Personal Account
ar: حساب شخصي

source: Phone Number
ar: رقم الهاتف

source: Phone number is required
ar: رقم الهاتف مطلوب

source: Please confirm your password
ar: يرجى تأكيد كلمة المرور

source: Please enter {label}
ar: يرجى إدخال {label}

source: Please enter a password
ar: يرجى إدخال كلمة مرور

source: Please enter a valid email address
ar: يرجى إدخال بريد إلكتروني صالح

source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صالح

source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني

source: Please enter your first name
ar: يرجى إدخال الاسم الأول

source: Please enter your last name
ar: يرجى إدخال الاسم الأخير

source: Please fill in all fields
ar: يرجى ملء جميع الحقول

source: Please select your birthdate
ar: يرجى اختيار تاريخ الميلاد

source: Please select your gender
ar: يرجى اختيار الجنس

source: Posted by
ar: تم النشر بواسطة

source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

source: Random text
ar: نص عشوائي

source: Recover Password
ar: استعادة كلمة المرور

source: Select Your Birthdate
ar: اختر تاريخ ميلادك

source: Sign In
ar: تسجيل الدخول

source: Sign in to continue your journey
ar: سجل الدخول لمتابعة رحلتك

source: Sign Up
ar: إنشاء حساب

source: Signing in...
ar: جارٍ تسجيل الدخول...

source: Submit Request
ar: إرسال الطلب

source: Support request submitted successfully
ar: تم إرسال طلب الدعم بنجاح

source: Tap again to exit
ar: اضغط مرة أخرى للخروج

source: Text on Button
ar: نص على الزر

source: Theme Mode
ar: وضع السمة

source: This account has been disabled
ar: تم تعطيل هذا الحساب

source: This page is a place holder
ar: هذه الصفحة عبارة عن عنصر نائب

# tooManyFailedAttempts
source: Too many failed attempts. Please try again later
ar: عدد كبير جدًا من المحاولات الفاشلة. يرجى المحاولة لاحقًا

source: Type your old password and the new one to apply changes
ar: اكتب كلمة المرور القديمة والجديدة لتطبيق التغييرات

source: Type your password to apply changes
ar: اكتب كلمة المرور لتطبيق التغييرات

source: Unknown User
ar: مستخدم غير معروف

source: User not logged in
ar: المستخدم لم يسجل دخوله

# weNeedAFewMoreDetails
source: We need a few more details to get you started
ar: نحتاج إلى بعض التفاصيل الإضافية لبدء استخدامك

source: Welcome Back!
ar: مرحبًا بعودتك!

source: Would you like to take a picture or choose from gallery?
ar: هل ترغب في التقاط صورة أو الاختيار من المعرض؟

source: Write a comment...
ar: اكتب تعليقًا...

source: Wrong password
ar: كلمة مرور خاطئة

source: You can interact with me in multiple ways:
ar: يمكنك التفاعل معي بعدة طرق:

source: 👋 Hi there! I'm B-BOT
ar: 👋 أهلاً! أنا B-BOT

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

# farmerRoleDescription
source: • Can add and manage lands • Can upload progress proofs • Can chat with sponsors • Can add new users (admin privileges)
ar: • يمكنه إضافة وإدارة الأراضي • يمكنه رفع إثباتات التقدم • يمكنه الدردشة مع الرعاة • يمكنه إضافة مستخدمين جدد (صلاحيات المشرف)

# sponsorRoleDescription
source: • Can browse and sponsor projects • Can chat with farmers • Can view progress updates
ar: • يمكنه تصفح وتمويل المشاريع • يمكنه الدردشة مع المزارعين • يمكنه الاطلاع على تحديثات التقدم

# userWithPhoneNumberExists
source: A user with this phone number already exists
ar: يوجد مستخدم بهذا الرقم بالفعل

source: Active Lands
ar: الأراضي النشطة

source: Active Projects
ar: المشاريع النشطة

source: Active Sponsor
ar: الراعي النشط

source: Add Land
ar: إضافة أرض

source: Add New User
ar: إضافة مستخدم جديد

source: Add Photos (Max 8)
ar: أضف صورًا (بحد أقصى 8)

source: Add Progress Photos (Max 3)
ar: أضف صور تقدم (بحد أقصى 3)

source: Add User
ar: إضافة مستخدم

source: Add Your First Farm
ar: أضف مزرعتك الأولى

source: Add Your First Land
ar: أضف أرضك الأولى

# addYourFirstLandToStart
source: Add your first land to start seeking sponsorship
ar: أضف أرضك الأولى لبدء البحث عن رعاة

source: AI Assistant
ar: المساعد الذكي

source: AI Chat
ar: الذكاء الاصطناعي

source: Almost Complete (75-99%)
ar: على وشك الاكتمال (75-99%)

source: ALMOST THERE
ar: قاربنا على الوصول

source: Amount must be greater than 0
ar: المبلغ يجب أن يكون أكبر من 0

source: Amount Raised
ar: المبلغ المجمّع

source: Apply Filters
ar: تطبيق المرشحات

# asAFarmerYouCanInvite
source: As a farmer (admin), you can invite new users to join the platform
ar: بصفتك مزارعًا (مشرف)، يمكنك دعوة مستخدمين جدد للمنصة

source: Basic Information
ar: المعلومات الأساسية

# browseProjectsAndMakeADifference
source: Browse available projects and start making a difference in rural farming communities
ar: تصفح المشاريع المتاحة وابدأ في إحداث فرق في المجتمعات الزراعية الريفية

source: Browse Projects
ar: تصفح المشاريع

source: Clear Filters
ar: إزالة المرشحات

# appTagline
source: Connecting women farmers with investors for sustainable agriculture
ar: ربط المزارعات بالمستثمرين من أجل زراعة مستدامة

source: Continue as User
ar: المتابعة كمستخدم

# describeCurrentProgress
source: Describe the current progress, any challenges, achievements, or observations...
ar: صف التقدم الحالي، أي تحديات أو إنجازات أو ملاحظات...

# describeYourLand
source: Describe your land, soil type, current condition...
ar: صف أرضك، نوع التربة، حالتها الحالية...

# descriptionRequired
source: Description *
ar: الوصف *

# discoverFarmingOpportunities
source: Discover farming opportunities and support sustainable agriculture
ar: اكتشف فرص الزراعة وادعم الزراعة المستدامة

source: Due Soon
ar: مستحق قريبًا

source: Email (Optional)
ar: البريد الإلكتروني (اختياري)

source: Enter size
ar: أدخل الحجم

source: Enter valid amount
ar: أدخل مبلغًا صالحًا

# errorLoadingLands
source: Error loading lands: {e}
ar: خطأ أثناء تحميل الأراضي: {e}

source: Error loading messages
ar: خطأ أثناء تحميل الرسائل

# errorLoadingMessagesWithDetails
source: Error loading messages: {error}
ar: خطأ أثناء تحميل الرسائل: {error}

# errorLoadingProjects
source: Error loading projects: {e}
ar: خطأ أثناء تحميل المشاريع: {e}

# errorLoadingSponsoredLands
source: Error loading sponsored lands: {e}
ar: خطأ أثناء تحميل الأراضي الممولة: {e}

# errorLoadingSponsorships
source: Error loading sponsorships: {e}
ar: خطأ أثناء تحميل الرعايات: {e}

# errorLoadingUpdates
source: Error loading updates: {e}
ar: خطأ أثناء تحميل التحديثات: {e}

# errorLoadingYourLands
source: Error loading your lands: {e}
ar: خطأ أثناء تحميل أراضيك: {e}

# errorOccurredWhileUploadingImage
source: Error occurred while uploading the image: {e}
ar: حدث خطأ أثناء رفع الصورة: {e}

# errorPickingImages
source: Error picking images: {e}
ar: خطأ أثناء اختيار الصور: {e}

# errorProcessingSponsorship
source: Error processing sponsorship: {e}
ar: خطأ أثناء معالجة الرعاية: {e}

# errorGeneric
source: Error: {e}
ar: خطأ: {e}

source: Failed to load image
ar: فشل في تحميل الصورة

# failedToSendMessage
source: Failed to send message: {e}
ar: فشل في إرسال الرسالة: {e}

# failedToUpdateRole
source: Failed to update role: {toString}
ar: فشل في تحديث الدور: {toString}

source: Failed to upload image after multiple attempts
ar: فشل في رفع الصورة بعد عدة محاولات

source: Farmer Role:
ar: دور المزارع:

source: Farmers Helped
ar: عدد المزارعين الذين تمت مساعدتهم

source: Filter by Crop
ar: تصفية حسب المحصول

source: Filter by Funding Status
ar: تصفية حسب حالة التمويل

source: Filter Projects
ar: تصفية المشاريع

source: Find Projects to Support
ar: ابحث عن مشاريع لدعمها

source: Full Name
ar: الاسم الكامل

source: Fully Funded
ar: ممول بالكامل

source: Funding Breakdown
ar: تفاصيل التمويل

source: Funding Needs (TND)
ar: احتياجات التمويل (دينار تونسي)

source: Funding Progress
ar: تقدم التمويل

# helpLandReachFundingGoal
source: Help {title} reach its funding goal!
ar: ساعد {title} في الوصول إلى هدف التمويل!

# helpProjectReachFundingGoal
source: Help this project reach its funding goal!
ar: ساعد هذا المشروع في الوصول إلى هدف التمويل!

source: I'm a Farmer
ar: أنا مزارع

source: I'm an Investor
ar: أنا مستثمر

source: IN PROGRESS
ar: قيد التنفيذ

source: In Progress (25-75%)
ar: قيد التنفيذ (25-75%)

# intendedCropRequired
source: Intended Crop *
ar: المحصول المقصود *

source: Invalid number
ar: رقم غير صالح

source: Join Chat
ar: انضم إلى الدردشة

source: Just Started (0-25%)
ar: بدأ للتو (0-25%)

source: Land Images
ar: صور الأرض

source: Land Information
ar: معلومات الأرض

source: Land registered successfully!
ar: تم تسجيل الأرض بنجاح!

# landTitleRequired
source: Land Title *
ar: عنوان الأرض *

# loadedLandsCount
source: Loaded {length} lands
ar: تم تحميل {length} أرضًا

# locationRequired
source: Location *
ar: الموقع *

source: Maximum 3 images allowed for updates
ar: مسموح بثلاث صور فقط للتحديثات

source: Maximum 8 images allowed
ar: مسموح بثماني صور كحد أقصى

source: My Farm Dashboard
ar: لوحة تحكم مزرعتي

source: My Lands
ar: أراضيّ

source: My Sponsorships
ar: رعاياتي

# nameMustBeAtLeast2Chars
source: Name must be at least 2 characters long
ar: يجب أن يكون الاسم مكونًا من حرفين على الأقل

source: No Active Conversations
ar: لا توجد محادثات نشطة

source: No authenticated user
ar: لا يوجد مستخدم مسجل الدخول

source: No Conversations Available
ar: لا توجد محادثات متاحة

source: No Farms to Upload Proof
ar: لا توجد مزارع لرفع الإثبات

source: No lands registered yet
ar: لم يتم تسجيل أي أراضٍ بعد

source: No messages yet
ar: لا توجد رسائل بعد

source: No photos available
ar: لا توجد صور متاحة

source: No projects found
ar: لم يتم العثور على مشاريع

source: No sponsorships yet
ar: لا توجد رعايات بعد

source: No updates
ar: لا توجد تحديثات

source: No updates yet
ar: لا توجد تحديثات بعد

# onlyAdminsCanAddUsers
source: Only farmers (admins) can add new users
ar: فقط المزارعون (المديرون) يمكنهم إضافة مستخدمين جدد

# onlyAdminsCanAddUsersPlatform
source: Only farmers (admins) can add new users to the platform
ar: فقط المزارعون (المديرون) يمكنهم إضافة مستخدمين جدد إلى المنصة

source: Please add at least one image
ar: يرجى إضافة صورة واحدة على الأقل

source: Please add at least one photo
ar: يرجى إضافة صورة واحدة على الأقل

# pleaseEnterDescription
source: Please enter a description
ar: يرجى إدخال وصف

# pleaseEnterPhoneNumber
source: Please enter a phone number
ar: يرجى إدخال رقم هاتف

# pleaseEnterLandTitle
source: Please enter a title for your land
ar: يرجى إدخال عنوان لأرضك

source: Please enter location
ar: يرجى إدخال الموقع

# pleaseEnterTheUser
source: Please enter the user's name
ar: يرجى إدخال اسم المستخدم

# pleaseProvideDetailedUpdate
source: Please provide a more detailed update (at least 10 characters)
ar: يرجى تقديم تحديث أكثر تفصيلًا (10 أحرف على الأقل)

# pleaseProvideProgressUpdateNote
source: Please provide a progress update note
ar: يرجى تقديم ملاحظة عن التقدم

# pleaseSpecifyFundingNeed
source: Please specify at least one funding need
ar: يرجى تحديد حاجة تمويل واحدة على الأقل

# pleaseSpecifyCrop
source: Please specify the crop you plan to grow
ar: يرجى تحديد المحصول الذي تخطط لزراعته

source: Progress Note
ar: ملاحظة تقدم

source: Progress Photos
ar: صور التقدم

source: Project Chat
ar: محادثة المشروع

source: Project Details
ar: تفاصيل المشروع

source: Project Information
ar: معلومات المشروع

source: Project Name
ar: اسم المشروع

source: Project Updates
ar: تحديثات المشروع

source: Projects Completed
ar: المشاريع المكتملة

# projectsYouSupportCount
source: Projects You Support ({length})
ar: المشاريع التي تدعمها ({length})

source: Quick Actions
ar: إجراءات سريعة

source: Quick amounts:
ar: مبالغ سريعة:

source: Recent Updates
ar: أحدث التحديثات

source: Register Land
ar: تسجيل أرض

source: Register New Land
ar: تسجيل أرض جديدة

# remainingNeeded
source: Remaining needed: TND {remainingAmount}
ar: المتبقي المطلوب: {remainingAmount} دينار

# searchProjects
source: Search projects by name, location, or crop...
ar: ابحث عن مشاريع بالاسم أو الموقع أو المحصول...

source: SEEKING FUNDING
ar: يبحث عن تمويل

# selectFarmToUploadProof
source: Select a farm to upload progress proof and keep your sponsors updated
ar: اختر مزرعة لرفع إثبات التقدم وإبقاء الرعاة على اطلاع

# selectProjectToChat
source: Select a project to start or continue conversation with the farmer and other sponsors
ar: اختر مشروعًا لبدء أو متابعة المحادثة مع المزارع والرعاة الآخرين

source: Select Conversation
ar: اختر محادثة

source: Select Farm
ar: اختر مزرعة

source: Send encouragement or ask questions...
ar: أرسل تشجيعًا أو اطرح أسئلة...

source: Send Invitation
ar: إرسال دعوة

source: Sending Invitation...
ar: جاري إرسال الدعوة...

# shareAnUpdateWithSponsors
source: Share an update with your sponsors...
ar: شارك تحديثًا مع رعاتك...

# shareLandOpportunities
source: Share your land opportunities and connect with investors to grow your farming business
ar: شارك فرص أراضيك وتواصل مع المستثمرين لتنمية عملك الزراعي

# sizeInHectaresRequired
source: Size (hectares) *
ar: المساحة (هكتار) *

# specifyFundingNeeds
source: Specify how much funding you need for each category
ar: حدد مقدار التمويل الذي تحتاجه لكل فئة

# sponsorLandTitle
source: Sponsor {title}
ar: رعاية {title}

source: Sponsor Dashboard
ar: لوحة تحكم الراعي

source: Sponsor Now
ar: قم بالرعاية الآن

source: Sponsor Project
ar: رعاية المشروع

source: Sponsor Role:
ar: دور الراعي:

# sponsorshipAmountUsd
source: Sponsorship Amount ($)
ar: مبلغ الرعاية ($)

source: Sponsorship Amount (TND)
ar: مبلغ الرعاية (دينار)

# startConversationWithSponsors
source: Start a conversation with your sponsors
ar: ابدأ محادثة مع رعاتك

# startTheConversation
source: Start the conversation! Share updates, ask questions, or offer support.
ar: ابدأ المحادثة! شارك التحديثات، اطرح الأسئلة، أو قدم الدعم.

source: Submit Update
ar: إرسال التحديث

# supcomAddress
source: Sup'Com Raoued Km 3,5 - 2083, Ariana Tunisie
ar: المدرسة العليا للمواصلات - رواد كم 3.5، 2083، أريانة، تونس

source: Tap to chat
ar: اضغط للدردشة

source: Tap to upload progress proof
ar: اضغط لرفع إثبات التقدم

# thankYouForSupporting
source: Thank you for supporting sustainable agriculture and empowering rural farmers! 🌱
ar: شكرًا لدعمك الزراعة المستدامة وتمكين المزارعين الريفيين! 🌱

# thankYouForSponsorship
source: Thank you for your sponsorship!
ar: شكرًا على رعايتك!

# farmerWillPostUpdatesHere
source: The farmer will post progress updates here
ar: سيقوم المزارع بنشر تحديثات التقدم هنا

# transparentGroupChatDisclaimer
source: This is a transparent group chat. All messages are visible to project participants for safety and accountability.
ar: هذه محادثة جماعية شفافة. جميع الرسائل مرئية للمشاركين في المشروع من أجل الأمان والمساءلة.

# tipShareProgress
source: Tip: Share progress photos and updates to keep everyone engaged!
ar: نصيحة: شارك صور وتحديثات التقدم للحفاظ على تفاعل الجميع!

source: Total Contributed
ar: إجمالي المساهمات

source: Total Funding
ar: إجمالي التمويل

source: Total Hectares
ar: إجمالي الهكتارات

source: Total Lands
ar: إجمالي الأراضي

source: Total Needed
ar: الإجمالي المطلوب

source: Total Raised
ar: الإجمالي المجموع

# tryAdjustingSearch
source: Try adjusting your search criteria
ar: جرب تعديل معايير البحث

source: Type a message...
ar: اكتب رسالة...

source: Unknown Farmer
ar: مزارع غير معروف

source: Update submitted successfully!
ar: تم إرسال التحديث بنجاح!

source: Update Type
ar: نوع التحديث

source: User Information
ar: معلومات المستخدم

source: View Details
ar: عرض التفاصيل

source: Weather feature coming soon!
ar: ميزة الطقس قادمة قريبًا!

source: Weekly updates recommended
ar: ينصح بالتحديثات الأسبوعية

# youNeedAdminPrivileges
source: You need farmer (admin) privileges to add new users
ar: تحتاج إلى صلاحيات مزارع (مدير) لإضافة مستخدمين جدد

# youNeedActiveFarmsToUpload
source: You need to have active farms to upload progress proofs.
ar: تحتاج إلى وجود مزارع نشطة لرفع إثباتات التقدم.

# youNeedActiveLandsToChat
source: You need to have active lands with sponsors to start conversations.
ar: تحتاج إلى وجود أراضٍ نشطة مع رعاة لبدء المحادثات.

# youNeedToSponsorToChat
source: You need to sponsor projects to start conversations with farmers.
ar: تحتاج إلى رعاية مشاريع لبدء محادثات مع المزارعين.

# yourFarmsCount
source: Your Farms ({length})
ar: مزارعك ({length})

source: Your Impact
ar: أثرك

# newSponsorJoinedUsd
source: 🎉 New sponsor joined! A generous contribution of ${amount} has been made to support this project.
ar: 🎉 انضم راعٍ جديد! تم تقديم مساهمة سخية بقيمة ${amount} لدعم هذا المشروع.

# newSponsorJoinedTnd
source: 🎉 New sponsor joined! A generous contribution of TND{amount} has been made to support this project.
ar: 🎉 انضم راعٍ جديد! تم تقديم مساهمة سخية بقيمة {amount} دينار لدعم هذا المشروع.

# photosLength
source: {length} photo(s)
ar: {length} صورة/صور

# fundedPercentage
source: {percentage}% funded
ar: ٪{percentage} ممول

source: Loading weather...
ar: جاري تحميل حالة الطقس...

# weatherError
source: Unable to load weather data
ar: تعذر تحميل بيانات الطقس

source: Retry
ar: إعادة المحاولة

source: Current Location
ar: الموقع الحالي

source: Temperature
ar: درجة الحرارة

source: Humidity
ar: الرطوبة

source: Wind
ar: الرياح

source: Precipitation
ar: الهطول

source: Sunrise
ar: شروق الشمس

source: Sunset
ar: غروب الشمس

# windSpeedUnit
source: m/s
ar: م/ث

# precipitationUnit
source: mm
ar: مم

# appBarTitle
source: AI Farming Assistant
ar: المساعد الزراعي الذكي

# welcomeMessage
source: 🌱 Hello! I'm your AI farming assistant. I can help you with: • Plant disease identification • Crop care advice • Soil and fertilizer recommendations • Irrigation guidance • Weather-based farming tips Feel free to ask questions or upload photos of your plants!
ar: 🌱 مرحبًا! أنا مساعدك الزراعي الذكي. أستطيع مساعدتك في: • تحديد أمراض النباتات • تقديم نصائح للعناية بالمحاصيل • اقتراح الأسمدة وتحليل التربة • إرشادات الري • نصائح زراعية حسب الطقس لا تتردد في طرح الأسئلة أو رفع صور لنباتاتك!

# aiBanner
source: AI-powered plant disease identification • Crop care advice • Voice enabled • 24/7 availability
ar: تحديد أمراض النباتات بالذكاء الاصطناعي • نصائح للعناية بالمحاصيل • دعم صوتي • متاح على مدار الساعة

# aiAnalyzing
source: AI is analyzing...
ar: الذكاء الاصطناعي يقوم بالتحليل...

source: Listening...
ar: يستمع...

source: Ask anything...
ar: اسأل أي شيء...

source: Error picking image:
ar: حدث خطأ أثناء اختيار الصورة:

# genericError
source: An error occurred while processing your message. Please try again.
ar: حدث خطأ أثناء معالجة رسالتك. يرجى المحاولة مرة أخرى.

source: Photo analysis request
ar: طلب تحليل صورة

source: Take photo for analysis
ar: التقط صورة للتحليل

# helpTitle
source: AI Assistant Help
ar: مساعدة المساعد الذكي

# helpWhatCanHelp
source: What can the AI help you with:
ar: ما الذي يمكن للذكاء الاصطناعي مساعدتك به:

source: Voice Features:
ar: الميزات الصوتية:

source: Tips for better results:
ar: نصائح للحصول على نتائج أفضل:

source: Got it!
ar: حسنًا!

# voiceFeaturesDesc
source: • Tap microphone to speak your question • Toggle speaker icon to enable/disable voice responses • Supports English, French, and Arabic
ar: • اضغط على الميكروفون لتحدث سؤالك • فعّل أو عطّل الردود الصوتية عبر رمز السماعة • يدعم الإنجليزية والفرنسية والعربية
