Repository: chater-marzougui/Zakaria-School
Catalog: lib/l10n/app_*.arb
Languages: ar

# tipsDesc
source: • Take clear, well-lit photos • Provide specific details about your problem • Mention your crop type and location • Ask follow-up questions for clarification
ar: • التقط صورًا واضحة ومضيئة جيدًا • قدم تفاصيل دقيقة حول مشكلتك • اذكر نوع المحصول والموقع • اطرح أسئلة متابعة للتوضيح

# processingTrouble
source: I'm having trouble processing your request. Could you try again?
ar: أواجه مشكلة في معالجة طلبك. هل يمكنك المحاولة مرة أخرى؟
